ambiot/amazon-freertos/vendors/realtek/boards/amebaD/ports/ota/aws_ota_rtl8721d.c
/*
Amazon FreeRTOS OTA PAL for Realtek Ameba V1.0.0
Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.

Permission is hereby granted, free of charge, to any person obtaining a copy of
this software and associated documentation files (the "Software"), to deal in
the Software without restriction, including without limitation the rights to
use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
the Software, and to permit persons to whom the Software is furnished to do so,
subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

 http://aws.amazon.com/freertos
 http://www.FreeRTOS.org
*/

/* OTA PAL implementation for Realtek Ameba platform. */
#include "aws_iot_ota_pal.h"
#include "aws_iot_ota_agent.h"
#include "iot_crypto.h"
#include "aws_ota_codesigner_certificate.h"
#include "aws_iot_ota_agent_internal.h"
#include "aws_application_version.h"
#include "platform_opts.h"

#include "flash_api.h"
#include <device_lock.h>
#include "rtl8721d_ota.h"
#include "platform_stdlib.h"
#include "platform_opts.h"

extern void PRCMHibernateCycleTrigger(void);
extern uint32_t update_ota_prepare_addr(void);

#define OTA_DEBUG 0
#define OTA_MEMDUMP 0
#define OTA_PRINT DiagPrintf

static uint32_t aws_ota_imgaddr = 0;
static uint32_t aws_ota_imgsz = 0;
static bool_t aws_ota_target_hdr_get = false;
static uint32_t ota_target_index = OTA_INDEX_2;
static uint32_t HdrIdx = 0;
static update_ota_target_hdr aws_ota_target_hdr;
static uint8_t aws_ota_signature[9] = {0};

#define OTA1_FLASH_START_ADDRESS 		LS_IMG2_OTA1_ADDR	//0x08006000
#define OTA2_FLASH_START_ADDRESS 		LS_IMG2_OTA2_ADDR	//0x08106000

//move to platform_opts.h
//#define AWS_OTA_IMAGE_STATE_FLASH_OFFSET          ( 0x101000 ) // 0x0810_0000 - 0x0810_2000-1
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW                  0xffffffffU /* 11111111b A new image that hasn't yet been run. */
#define AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT              0xfffffffeU /* 11111110b Image is pending commit and is ready for self test. */
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID               0xfffffffcU /* 11111100b The image was accepted as valid by the self test code. */
#define AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID           0xfffffff8U /* 11111000b The image was NOT accepted by the self test code. */

#if OTA_DEBUG && OTA_MEMDUMP
void vMemDump(const u8 *start, u32 size, char * strHeader)
{
    int row, column, index, index2, max;
    u8 *buf, *line;

    if(!start ||(size==0))
            return;

    line = (u8*)start;

    /*
    16 bytes per line
    */
    if (strHeader)
       DiagPrintf ("%s", strHeader);

    column = size % 16;
    row = (size / 16) + 1;
    for (index = 0; index < row; index++, line += 16)
    {
        buf = (u8*)line;

        max = (index == row - 1) ? column : 16;
        if ( max==0 ) break; /* If we need not dump this line, break it. */

        DiagPrintf ("\n[%08x] ", line);

        //Hex
        for (index2 = 0; index2 < max; index2++)
        {
            if (index2 == 8)
            DiagPrintf ("  ");
            DiagPrintf ("%02x ", (u8) buf[index2]);
        }

        if (max != 16)
        {
            if (max < 8)
                DiagPrintf ("  ");
            for (index2 = 16 - max; index2 > 0; index2--)
                DiagPrintf ("   ");
        }

    }

    DiagPrintf ("\n");
    return;
}
#endif

static void prvSysReset_rtl8721d(u32 timeout_ms)
{
	WDG_InitTypeDef WDG_InitStruct;
	u32 CountProcess;
	u32 DivFacProcess;

	//vTaskDelay(100);

	/* CPU reset: Cortex-M3 SCB->AIRCR*/
	//NVIC_SystemReset();

#if defined(CONFIG_MBED_API_EN) && CONFIG_MBED_API_EN
	rtc_backup_timeinfo();
#endif

	WDG_Scalar(timeout_ms, &CountProcess, &DivFacProcess);
	WDG_InitStruct.CountProcess = CountProcess;
	WDG_InitStruct.DivFacProcess = DivFacProcess;
	WDG_Init(&WDG_InitStruct);

	WDG_Cmd(ENABLE);
}

static __inline__ bool_t prvContextValidate_rtl8721d( OTA_FileContext_t *C )
{
    return pdTRUE;
}

OTA_Err_t prvPAL_Abort_rtl8721d(OTA_FileContext_t *C)
{
    if( NULL != C)
    {
        C->lFileHandle = 0x0;
    }
    return kOTA_Err_None;
}

bool_t prvPAL_CreateFileForRx_rtl8721d(OTA_FileContext_t *C)
{
	int sector_cnt = 0;
	int i=0;
	uint32_t data;
	flash_t flash;

	if (ota_get_cur_index() == OTA_INDEX_1) {
		ota_target_index = OTA_INDEX_2;
		C->lFileHandle = OTA2_FLASH_START_ADDRESS;
		sector_cnt = ((C->ulFileSize - 1) / (1024 * 4)) + 1;
		OTA_PRINT("\n\r[%s] OTA2 address space will be upgraded\n", __FUNCTION__);
	} else {
		ota_target_index = OTA_INDEX_1;
		C->lFileHandle = OTA1_FLASH_START_ADDRESS;
		sector_cnt = ((C->ulFileSize - 1) / (1024 * 4)) + 1;
		OTA_PRINT("\n\r[%s] OTA1 address space will be upgraded\n", __FUNCTION__);
	}

    if (C->lFileHandle > SPI_FLASH_BASE)
    {
    	OTA_PRINT("[OTA] valid ota addr (0x%x) \r\n", C->lFileHandle);
        aws_ota_imgaddr = 0;
        aws_ota_imgsz = 0;
        aws_ota_target_hdr_get = false;
        memset((void *)&aws_ota_target_hdr, 0, sizeof(update_ota_target_hdr));
        memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
        aws_ota_imgaddr = C->lFileHandle;
        data = HAL_READ32(SPI_FLASH_BASE, FLASH_SYSTEM_DATA_ADDR);
        OTA_PRINT("[OTA] addr: 0x%08x, data 0x%08x\r\n", aws_ota_imgaddr, data);
        for( i = 0; i < sector_cnt; i++)
        {
            OTA_PRINT("[OTA] Erase sector_cnt @ 0x%x\n", C->lFileHandle - SPI_FLASH_BASE + i * (1024*4));
            erase_ota_target_flash(aws_ota_imgaddr - SPI_FLASH_BASE + i * (1024*4), (1024*4));
	    }
    }
    else {
        OTA_PRINT("[OTA] invalid ota addr (%d) \r\n", C->lFileHandle);
        C->lFileHandle = NULL;      /* Nullify the file handle in all error cases. */
    }
    return ( C->lFileHandle > SPI_FLASH_BASE ) ? pdTRUE : pdFALSE;
}

/* Read the specified signer certificate from the filesystem into a local buffer. The
 * allocated memory becomes the property of the caller who is responsible for freeing it.
 */
uint8_t * prvPAL_ReadAndAssumeCertificate_rtl8721d(const uint8_t * const pucCertName, int32_t * const lSignerCertSize)
{
	uint8_t*	pucCertData;
	uint32_t	ulCertSize;
	uint8_t 	*pucSignerCert = NULL;

	extern BaseType_t PKCS11_PAL_GetObjectValue( const char * pcFileName,
							   uint8_t ** ppucData,
							   uint32_t * pulDataSize );

	if ( PKCS11_PAL_GetObjectValue( (const char *) pucCertName, &pucCertData, &ulCertSize ) != pdTRUE )
	{	/* Use the back up "codesign_keys.h" file if the signing credentials haven't been saved in the device. */
		pucCertData = (uint8_t*) signingcredentialSIGNING_CERTIFICATE_PEM;
		ulCertSize = sizeof( signingcredentialSIGNING_CERTIFICATE_PEM );
		OTA_LOG_L1( "Assume Cert - No such file: %s. Using header file\r\n",
				   (const char*)pucCertName );
	}
	else
	{
		OTA_LOG_L1( "Assume Cert - file: %s OK\r\n", (const char*)pucCertName );
	}

	/* Allocate memory for the signer certificate plus a terminating zero so we can load it and return to the caller. */
	pucSignerCert = pvPortMalloc( ulCertSize +	1);
	if ( pucSignerCert != NULL )
	{
		memcpy( pucSignerCert, pucCertData, ulCertSize );
		/* The crypto code requires the terminating zero to be part of the length so add 1 to the size. */
		pucSignerCert[ ulCertSize ] = '\0';
		*lSignerCertSize = ulCertSize + 1;
	}
	return pucSignerCert;
}

static OTA_Err_t prvSignatureVerificationUpdate_rtl8721d(OTA_FileContext_t *C, void * pvContext)
{
    u32 i;
    flash_t flash;
    u8 * pTempbuf;
    int rlen;
    u32 len = aws_ota_imgsz;
    u32 addr = aws_ota_target_hdr.FileImgHdr[HdrIdx].FlashAddr;
    OTA_Err_t eResult = kOTA_Err_None;
    if(len <= 0) {
      eResult = kOTA_Err_SignatureCheckFailed;
      return eResult;
    }

