ambiot/amazon-freertos/vendors/realtek/boards/amebaD/ports/ota/aws_ota_rtl8721d.c
    /*the upgrade space should be masked, because the encrypt firmware is used
    for checksum calculation*/
    //OTF_Mask(1, (addr - SPI_FLASH_BASE), NewImg2BlkSize, 1);

    pTempbuf = ota_update_malloc(BUF_SIZE);
    if(!pTempbuf){
        eResult = kOTA_Err_SignatureCheckFailed;
        goto error;
    }

    /*add image signature(81958711)*/
	CRYPTO_SignatureVerificationUpdate(pvContext, aws_ota_signature, 8);

    len = len-8;
    /* read flash data back to check signature of the image */
    for(i=0;i<len;i+=BUF_SIZE){
    	rlen = (len-i)>BUF_SIZE?BUF_SIZE:(len-i);
		device_mutex_lock(RT_DEV_LOCK_FLASH);
    	flash_stream_read(&flash, addr - SPI_FLASH_BASE+i+8, rlen, pTempbuf);
    	Cache_Flush();
    	device_mutex_unlock(RT_DEV_LOCK_FLASH);
		CRYPTO_SignatureVerificationUpdate(pvContext, pTempbuf, rlen);
    }

error:
    if(pTempbuf)
        ota_update_free(pTempbuf);
    return eResult;
}

#if (defined(__ICCARM__))
extern void *calloc_freertos(size_t nelements, size_t elementSize);
#endif
OTA_Err_t prvPAL_SetPlatformImageState_rtl8721d (OTA_ImageState_t eState);
OTA_Err_t prvPAL_CheckFileSignature_rtl8721d(OTA_FileContext_t * const C)
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CheckFileSignature_rtl8721d" );

    OTA_Err_t eResult;
    int32_t lSignerCertSize;
    void *pvSigVerifyContext;
    uint8_t *pucSignerCert = NULL;
#if (defined(__ICCARM__))
	mbedtls_platform_set_calloc_free(calloc_freertos, vPortFree);
#endif

    while(true)
    {
        /* Verify an ECDSA-SHA256 signature. */
        if (CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA,
                                              cryptoHASH_ALGORITHM_SHA256) == pdFALSE)
        {
            eResult = kOTA_Err_SignatureCheckFailed;
            break;
        }

        OTA_LOG_L1( "[%s] Started %s signature verification, file: %s\r\n", OTA_METHOD_NAME,
                   cOTA_JSON_FileSignatureKey, (const char*)C->pucCertFilepath);
        pucSignerCert = prvPAL_ReadAndAssumeCertificate_rtl8721d((const uint8_t* const)C->pucCertFilepath, &lSignerCertSize);
        if (pucSignerCert == NULL)
        {
            eResult = kOTA_Err_BadSignerCert;
            break;
        }

        eResult = prvSignatureVerificationUpdate_rtl8721d(C, pvSigVerifyContext);
        if(eResult != kOTA_Err_None)
        {
            break;
		}
        if ( CRYPTO_SignatureVerificationFinal(pvSigVerifyContext, (char*)pucSignerCert, lSignerCertSize,
                                                    C->pxSignature->ucData, C->pxSignature->usSize ) == pdFALSE )
        {
            eResult = kOTA_Err_SignatureCheckFailed;
            prvPAL_SetPlatformImageState_rtl8721d(eOTA_ImageState_Rejected);
        }
        else
        {
            eResult = kOTA_Err_None;
        }
        break;
    }
    /* Free the signer certificate that we now own after prvPAL_ReadAndAssumeCertificate(). */
    if( pucSignerCert != NULL )
    {
        vPortFree(pucSignerCert);
    }
    return eResult;
}

/* Close the specified file. This will also authenticate the file if it is marked as secure. */
OTA_Err_t prvPAL_CloseFile_rtl8721d(OTA_FileContext_t *C)
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_CloseFile" );
    OTA_Err_t eResult = kOTA_Err_None;

    OTA_PRINT("[OTA] Authenticating and closing file.\r\n");

    if( prvContextValidate_rtl8721d( C ) == pdFALSE )
    {
        eResult = kOTA_Err_FileClose;
    }

    if( kOTA_Err_None == eResult )
    {
        if( C->pxSignature != NULL )
        {
            OTA_LOG_L1( "[%s] Authenticating and closing file.\r\n", OTA_METHOD_NAME );
            #if OTA_DEBUG && OTA_MEMDUMP
            vMemDump(C->pxSignature->ucData, C->pxSignature->usSize, "Signature");
            #endif
            /* TODO: Verify the file signature, close the file and return the signature verification result. */
            eResult = prvPAL_CheckFileSignature_rtl8721d( C );
            //eResult = kOTA_Err_None;
        }
        else
        {
            eResult = kOTA_Err_SignatureCheckFailed;
        }
    }

    return eResult;
}

int32_t prvPAL_WriteBlock_rtl8721d(OTA_FileContext_t *C, int32_t iOffset, uint8_t* pacData, uint32_t iBlockSize)
{
    flash_t flash;
    uint32_t address = C->lFileHandle - SPI_FLASH_BASE;
    uint32_t NewImg2Len = 0;
    uint32_t NewImg2BlkSize = 0;
    static bool_t wait_target_img = true;
    static uint32_t img_sign = 0;
    uint32_t WriteLen, offset;
    uint32_t version=0,major=0,minor=0,build=0;

	if (aws_ota_target_hdr_get != true)
	{
        u32 RevHdrLen;
        int i;
        if(iOffset == 0)
        {
	        wait_target_img = true;
	        img_sign = 0;
	        memset((void *)&aws_ota_target_hdr, 0, sizeof(update_ota_target_hdr));
	        memset((void *)aws_ota_signature, 0, sizeof(aws_ota_signature));
	        memcpy((u8*)(&aws_ota_target_hdr.FileHdr), pacData, sizeof(aws_ota_target_hdr.FileHdr));
	        if(aws_ota_target_hdr.FileHdr.HdrNum > 2 || aws_ota_target_hdr.FileHdr.HdrNum <= 0)
	        {
	            OTA_PRINT("INVALID IMAGE BLOCK 0\r\n");
				#if OTA_DEBUG && OTA_MEMDUMP
	            vMemDump(pacData, iBlockSize, NULL);
	            #endif
	            return -1;
	        }
	        memcpy((u8*)(&aws_ota_target_hdr.FileImgHdr[HdrIdx]), pacData+sizeof(aws_ota_target_hdr.FileHdr), 8);
	        RevHdrLen = (aws_ota_target_hdr.FileHdr.HdrNum * aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgHdrLen) + sizeof(aws_ota_target_hdr.FileHdr);
	        if (!get_ota_tartget_header(pacData, RevHdrLen, &aws_ota_target_hdr, ota_target_index))
	        {
	            OTA_PRINT("Get OTA header failed\n");
	            #if OTA_DEBUG && OTA_MEMDUMP
	            vMemDump(pacData, iBlockSize, "Header");
	            #endif
	            return -1;
	        }
#if 0
			printf("aws_ota_target_hdr.FileHdr.FwVer=0x%08X\n",aws_ota_target_hdr.FileHdr.FwVer);
			printf("aws_ota_target_hdr.FileHdr.FwVer=0x%08X\n",aws_ota_target_hdr.FileHdr.HdrNum);
			printf("aws_ota_target_hdr.FileImgHdr[%d].ImgId=%s\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgId);
			printf("aws_ota_target_hdr.FileImgHdr[%d].ImgHdrLen=0x%08X\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgHdrLen);
			printf("aws_ota_target_hdr.FileImgHdr[%d].Checksum=0x%08X\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].Checksum);
			printf("aws_ota_target_hdr.FileImgHdr[%d].ImgLen=0x%08X\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen);
			printf("aws_ota_target_hdr.FileImgHdr[%d].Offset=0x%08X\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].Offset);
			printf("aws_ota_target_hdr.FileImgHdr[%d].FlashAddr=0x%08X\n",HdrIdx, aws_ota_target_hdr.FileImgHdr[HdrIdx].FlashAddr);
			printf("aws_ota_target_hdr.ValidImgCnt=%d\n",aws_ota_target_hdr.ValidImgCnt);
#endif
			version = aws_ota_target_hdr.FileHdr.FwVer;
			major = version / 1000000;
			minor = (version - (major*1000000)) / 1000;
			build = (version - (major*1000000) - (minor * 1000))/1;
			if( aws_ota_target_hdr.FileHdr.FwVer <= (APP_VERSION_MAJOR*1000000 + APP_VERSION_MINOR * 1000 + APP_VERSION_BUILD))
			{
				OTA_PRINT("OTA failed!!!\n");
				OTA_PRINT("New Firmware version(%d,%d,%d) must greater than current firmware version(%d,%d,%d)\n",major,minor,build,APP_VERSION_MAJOR,APP_VERSION_MINOR,APP_VERSION_BUILD);
				prvSysReset_rtl8721d(500);
				return -1;
			}
			else
			{
				OTA_PRINT("New Firmware version (%d,%d,%d), current firmware version(%d,%d,%d)\n",major,minor,build,APP_VERSION_MAJOR,APP_VERSION_MINOR,APP_VERSION_BUILD);
			}

	        /*get new image length from the firmware header*/
	        NewImg2Len = aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen;
	        NewImg2BlkSize = ((NewImg2Len - 1)/4096) + 1;

	        OTA_PRINT("[OTA][%s] NewImg2BlkSize %d\n", __FUNCTION__, NewImg2BlkSize);
	        aws_ota_target_hdr_get = true;
        }
        else
        {
	        aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen = C->ulFileSize - (C->ulFileSize%1024) - 1024;
	        aws_ota_target_hdr.FileHdr.HdrNum = 0x1;
	        aws_ota_target_hdr.FileImgHdr[HdrIdx].Offset = 0x20;
        }
    }

