ambiot/amazon-freertos/vendors/realtek/boards/amebaD/ports/ota/aws_ota_rtl8721d.c
    OTA_PRINT("[OTA][%s] iFileSize %d, iOffset: 0x%x: iBlockSize: 0x%x\n", __FUNCTION__, C->ulFileSize, iOffset, iBlockSize);
    if(aws_ota_imgsz >= aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen){
        OTA_PRINT("[OTA] image download is already done, dropped, aws_ota_imgsz=0x%X, ImgLen=0x%X\n",aws_ota_imgsz,aws_ota_target_hdr.FileImgHdr[aws_ota_target_hdr.FileHdr.HdrNum].ImgLen);
        return iBlockSize;
    }

    if(wait_target_img == true && iOffset <= aws_ota_target_hdr.FileImgHdr[HdrIdx].Offset) {
        uint32_t byte_to_write = (iOffset + iBlockSize) - aws_ota_target_hdr.FileImgHdr[HdrIdx].Offset;
        int i=0;
        pacData += (iBlockSize -byte_to_write);
        OTA_PRINT("[OTA] FIRST image data arrived %d\n", byte_to_write);
        if(img_sign < 8){
            img_sign = (byte_to_write > 8)?8:byte_to_write;
            memcpy(aws_ota_signature, pacData, img_sign);
            memcpy(aws_ota_target_hdr.Sign[HdrIdx],pacData,img_sign);
            OTA_PRINT("[OTA] Signature get [%d]%s\n", img_sign, aws_ota_signature);
            byte_to_write -= img_sign;
            pacData += img_sign;
            aws_ota_imgsz += img_sign;
        }

        device_mutex_lock(RT_DEV_LOCK_FLASH);
        OTA_PRINT("[OTA] FIRST Write %d bytes @ 0x%x\n", byte_to_write, address);
        //if(flash_stream_write(&flash, address+8, byte_to_write, pacData) < 0){
        if(ota_writestream_user(address+8, byte_to_write, pacData) < 0){
            OTA_PRINT("[%s] Write sector failed\n", __FUNCTION__);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);
            return -1;
        }
#if OTA_DEBUG && OTA_MEMDUMP
        vMemDump(pacData, byte_to_write, "PAYLOAD1");
#endif
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        aws_ota_imgsz += byte_to_write;
        if (img_sign >= 8)
            wait_target_img = false;
        return iBlockSize;
    }

    WriteLen = iBlockSize;
    offset = iOffset - aws_ota_target_hdr.FileImgHdr[HdrIdx].Offset;
    if ((offset + iBlockSize) >= aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen) {

		if(offset > aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen)
			return iBlockSize;
        WriteLen -= (offset + iBlockSize - aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen);
        OTA_PRINT("[OTA] LAST image data arrived %d\n", WriteLen);
    }

    device_mutex_lock(RT_DEV_LOCK_FLASH);
    OTA_PRINT("[OTA] Write %d bytes @ 0x%x (0x%x)\n", WriteLen, address + offset, (address + offset - 0x6000));
    if(ota_writestream_user(address + offset, WriteLen, pacData) < 0){
        OTA_PRINT("[%s] Write sector failed\n", __FUNCTION__);
        device_mutex_unlock(RT_DEV_LOCK_FLASH);
        return -1;
    }
#if OTA_DEBUG && OTA_MEMDUMP
    vMemDump(pacData, iBlockSize, "PAYLOAD2");
#endif
    device_mutex_unlock(RT_DEV_LOCK_FLASH);
    aws_ota_imgsz += WriteLen;

    return iBlockSize;
}

OTA_Err_t prvPAL_ActivateNewImage_rtl8721d(void)
{
    flash_t flash;
    /* Reset the MCU so we can test the new image. Short delay for debug log output. */
    OTA_PRINT("[OTA] [%s] Download new firmware %d bytes completed @ 0x%x\n", __FUNCTION__, aws_ota_imgsz, aws_ota_target_hdr.FileImgHdr[HdrIdx].FlashAddr);
    OTA_PRINT("[OTA] signature: %s, size = %d, OtaTargetHdr.FileImgHdr.ImgLen = %d\n", aws_ota_signature, aws_ota_imgsz, aws_ota_target_hdr.FileImgHdr[HdrIdx].ImgLen);
    /*------------- verify checksum and update signature-----------------*/
    if(verify_ota_checksum( &aws_ota_target_hdr)){
        if(!change_ota_signature(&aws_ota_target_hdr, ota_target_index)) {
            OTA_PRINT("[OTA] [%s], change signature failed\r\n", __FUNCTION__);
            return kOTA_Err_ActivateFailed;
        } else {
            flash_erase_sector(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET);
            flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT);
            OTA_PRINT("[OTA] [%s] Update OTA success!\r\n", __FUNCTION__);
        }
    }else{
        /*if checksum error, clear the signature zone which has been written in flash in case of boot from the wrong firmware*/
        flash_erase_sector(&flash, aws_ota_target_hdr.FileImgHdr[HdrIdx].FlashAddr - SPI_FLASH_BASE);
        OTA_PRINT("[OTA] [%s] The checksume is wrong!\n\r", __FUNCTION__);
        return kOTA_Err_ActivateFailed;
    }
    OTA_PRINT("[OTA] Resetting MCU to activate new image.\r\n");
    vTaskDelay( 500 );
    prvSysReset_rtl8721d(10);
    //return kOTA_Err_None;
}

OTA_Err_t prvPAL_ResetDevice_rtl8721d ( void )
{
    prvSysReset_rtl8721d(10);
    return kOTA_Err_None;
}

OTA_Err_t prvPAL_SetPlatformImageState_rtl8721d (OTA_ImageState_t eState)
{
    DEFINE_OTA_METHOD_NAME( "prvSetImageState_rtl8721d" );
    OTA_Err_t eResult = kOTA_Err_Uninitialized;
    uint32_t ota_imagestate =  AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID;
    flash_t flash;

    device_mutex_lock(RT_DEV_LOCK_FLASH);
    flash_read_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, &ota_imagestate);
    device_mutex_unlock(RT_DEV_LOCK_FLASH);

    if ( eState == eOTA_ImageState_Accepted )
    {
        /* This should be an image launched in self test mode! */
        if ( ota_imagestate == AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT )
        {
            /* Mark the image as valid */
            ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID;

            device_mutex_lock(RT_DEV_LOCK_FLASH);
            flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, ota_imagestate);
            device_mutex_unlock(RT_DEV_LOCK_FLASH);

            {
                OTA_LOG_L1( "[%s] Accepted and committed final image.\r\n", OTA_METHOD_NAME );

                /* Disable the watchdog timer. */
                //prvPAL_WatchdogDisable();

                eResult = kOTA_Err_None;
            }
#if 0
            else
            {
                OTA_LOG_L1( "[%s] Accepted final image but commit failed (%d).\r\n", OTA_METHOD_NAME,
                           MCHP_ERR_FLASH_WRITE_FAIL );
                eResult = ( uint32_t ) kOTA_Err_CommitFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
            }
#endif
        }
        else
        {
            OTA_LOG_L1( "[%s] Warning: image is not pending commit (0x%02x)\r\n", OTA_METHOD_NAME, ota_imagestate );
            if ( ota_imagestate == AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID )
            {
                eResult = kOTA_Err_None;
            }
            else
            {
                eResult = ( uint32_t ) kOTA_Err_CommitFailed/* | ( ( ( uint32_t ) MCHP_ERR_NOT_PENDING_COMMIT ) & ( uint32_t ) kOTA_PAL_ErrMask )*/;
            }
        }
    }
    else if ( eState == eOTA_ImageState_Rejected )
    {
    	u32 ota_target_reset_index;
        OTA_LOG_L1( "[%s] Rejecting and invalidating image.\r\n", OTA_METHOD_NAME );
		if (ota_get_cur_index() == OTA_INDEX_1) {
			ota_target_reset_index = OTA_INDEX_2;
		}
		else {
			ota_target_reset_index = OTA_INDEX_1;
		}

		ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW;
		device_mutex_lock(RT_DEV_LOCK_FLASH);
		flash_erase_sector(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET);
		flash_write_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, ota_imagestate);
		device_mutex_unlock(RT_DEV_LOCK_FLASH);

        eResult = kOTA_Err_None;
#if 0
        else {
            OTA_LOG_L1( "[%s] Reject failed to invalidate the final image (%d).\r\n", OTA_METHOD_NAME,
                        MCHP_ERR_FLASH_WRITE_FAIL );
            eResult = ( uint32_t ) kOTA_Err_RejectFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
        }
#endif
    }
    else if ( eState == eOTA_ImageState_Aborted )
    {
        OTA_LOG_L1( "[%s] Aborting and invalidating image.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_None;
#if 0
        else {
            OTA_LOG_L1( "[%s] Abort failed to invalidate the final image (%d).\r\n", OTA_METHOD_NAME,
                        MCHP_ERR_FLASH_WRITE_FAIL );
            eResult = ( uint32_t ) kOTA_Err_AbortFailed | ( ( ( uint32_t ) MCHP_ERR_FLASH_WRITE_FAIL ) & ( uint32_t ) kOTA_PAL_ErrMask );
        }
#endif
    }
    else if ( eState == eOTA_ImageState_Testing )
    {
        OTA_LOG_L1( "[%s] Testing image.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_None;
    }
    else
    {
        OTA_LOG_L1( "[%s] Bad Image State.\r\n", OTA_METHOD_NAME );
        eResult = kOTA_Err_BadImageState;
    }
	return eResult;
}

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState_rtl8721d( void )
{
    DEFINE_OTA_METHOD_NAME( "prvPAL_GetPlatformImageState_rtl8721d" );

