ambiot/amazon-freertos/vendors/realtek/boards/amebaD/ports/ota/aws_ota_rtl8721d.c
    OTA_PAL_ImageState_t eImageState = eOTA_PAL_ImageState_Unknown;
    uint32_t ota_imagestate =  AWS_OTA_IMAGE_STATE_FLAG_IMG_INVALID;
    flash_t flash;

    device_mutex_lock(RT_DEV_LOCK_FLASH);
    flash_read_word(&flash, AWS_OTA_IMAGE_STATE_FLASH_OFFSET, &ota_imagestate);
    device_mutex_unlock(RT_DEV_LOCK_FLASH);

    switch ( ota_imagestate )
    {
        case AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT:
        {
            /* Pending Commit means we're in the Self Test phase. */
            printf("ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_PENDING_COMMIT\n");
            eImageState = eOTA_PAL_ImageState_PendingCommit;
            break;
        }
        case AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID:
        {
            printf("ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_VALID\n");
            eImageState = eOTA_PAL_ImageState_Valid;
            break;
        }
        case AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW:
        {
            eImageState = eOTA_PAL_ImageState_Valid;
            printf("ota_imagestate = AWS_OTA_IMAGE_STATE_FLAG_IMG_NEW\n");
            break;
        }
        default:
        {
            eImageState = eOTA_PAL_ImageState_Invalid;
            printf("ota_imagestate = default\n");
            break;
        }
    }
    OTA_LOG_L1( "[%s] Image current state (0x%02x)\r\n", OTA_METHOD_NAME, eImageState );
    return eImageState;
}

u8 * prvReadAndAssumeCertificate_rtl8721d(const u8 * const pucCertName, s32 * const lSignerCertSize)
{
    OTA_PRINT( ("prvReadAndAssumeCertificate: not implemented yet\r\n") );
    return NULL;
}

